In [1]:
import pandas as pd

In [2]:
# two dimentational contacts list
contacts = [['Mike Green', 'demo1@deitel.com', '5555555555'],['Sue Brown', 'demo2@dietel.com', '5555551234']]

In [3]:
contactsdf = pd.DataFrame(contacts, columns=['Name', 'Email', 'Phone'])

In [4]:
contactsdf

         Name             Email       Phone
0  Mike Green  demo1@deitel.com  5555555555
1   Sue Brown  demo2@dietel.com  5555551234

In [5]:
# ask is to modify phone number 5555555555 to 555-555-5555
# create a function to perform modification
import re
def get_formatted_phone(value):
    result = re.match(r'(\d{3})(\d{3})(\d{4})', value)
    return '-'.join(result.groups()) if result else value

In [6]:
contactsdf['Phone'].map(get_formatted_phone)

0    555-555-5555
1    555-555-1234
Name: Phone, dtype: object

In [7]:
#however, original pandas frame is not modified
contactsdf

         Name             Email       Phone
0  Mike Green  demo1@deitel.com  5555555555
1   Sue Brown  demo2@dietel.com  5555551234

In [8]:
contactsdf['Phone'] = contactsdf['Phone'].map(get_formatted_phone)

In [9]:
contactsdf

         Name             Email         Phone
0  Mike Green  demo1@deitel.com  555-555-5555
1   Sue Brown  demo2@dietel.com  555-555-1234

In [10]:
# exercies 
# Now modify the dataframe to give phone numbers in (###) ###-#### format.
contacts = [['Mike Green', 'demo1@deitel.com', '5555555555'],['Sue Brown', 'demo2@dietel.com', '5555551234']]
contactsdf = pd.DataFrame(contacts, columns=['Name', 'Email', 'Phone'])

In [11]:
contactsdf

         Name             Email       Phone
0  Mike Green  demo1@deitel.com  5555555555
1   Sue Brown  demo2@dietel.com  5555551234

In [12]:
import re
def get_formatted_phone(value):
    result = re.match(r'(\d{3})(\d{3})(\d{4})', value)
    return join_result(result) if result else value

def join_result(result):
    part1, part2, part3 = result.groups()
    return '(' + part1 + ') ' + part2 + "-" + part3

In [13]:
contactsdf['Phone'] = contactsdf['Phone'].map(get_formatted_phone)

In [14]:
contactsdf

         Name             Email           Phone
0  Mike Green  demo1@deitel.com  (555) 555-5555
1   Sue Brown  demo2@dietel.com  (555) 555-1234